xinge0721/balance-car-STM32/Hardware/MYI2C.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "MPU6050.h"

void MyI2C_W_SCL(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_3, (BitAction)BitValue);		
	Delay_us(10);												
}
void MyI2C_W_SDA(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_4, (BitAction)BitValue);		
	Delay_us(10);												
}

uint8_t MyI2C_R_SDA(void)
{
	uint8_t BitValue;
	BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_4);		
	Delay_us(10);												
	return BitValue;											
}
void MyI2C_Init(void)
{
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);	
	
	GPIO_SetBits(GPIOB, GPIO_Pin_3 | GPIO_Pin_4);	
}

void MyI2C_Start(void)
{
	MyI2C_W_SDA(1);
	MyI2C_W_SCL(1);
	MyI2C_W_SDA(0);
	MyI2C_W_SCL(0);
}

void MyI2C_Stop(void)
{	
	MyI2C_W_SDA(0);
	MyI2C_W_SCL(1);
	MyI2C_W_SDA(1);
}

void MyI2C_SendByte(uint8_t Byte)
{
	for(int i = 0 ; i < 8 ; i++)
	{
		MyI2C_W_SDA(Byte & (0x80 >> i));
		MyI2C_W_SCL(1);
		MyI2C_W_SCL(0);
	}
}

uint8_t MyI2C_ReceiveByte(void)
{
	uint8_t data = 0x00;
	MyI2C_W_SDA(1);							
	for(int i = 0 ; i < 8 ; i++)
	{		
		MyI2C_W_SCL(1);
		if(MyI2C_R_SDA()) data |= (0x80 >> i);
		MyI2C_W_SCL(0);
	}
	return data;
}

void MyI2C_SendAck(uint8_t AckBit)
{
		MyI2C_W_SCL(AckBit);
		MyI2C_W_SCL(1);
		MyI2C_W_SCL(0);
}

uint8_t MyI2C_ReceiveAck(void)
{
	uint8_t data = 0;
	MyI2C_W_SDA(1);							
	MyI2C_W_SCL(1);
	if(MyI2C_R_SDA()) data = 1;
	MyI2C_W_SCL(0);
	return data;
}
